src/projects/configuration/251027_GKSTCPLK-1788/src/InformationRegisters/гкс_ПоказателиУсиленногоКонтроляПоРегистрации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>гкс_ПоказателиУсиленногоКонтроляПоРегистрации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеПоказателяМин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПоказателяМакс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Базис</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьСтатусКачества</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_СостоянияРегистрации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеКачества</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_СостоянияКачества</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>МестнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводственныеСутки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументРегистрации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_РегистрацияНаПЛК</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Показатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ПоказателиАнализовНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛабораторныйАнализ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_ЛабораторныйАнализ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НазначениеИспользования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_НазначенияИспользованияКачества</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/projects/configuration/251027_GKSTCPLK-1788/src/InformationRegisters/гкс_ПравилаУсиленногоКонтроляПоРегистрации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>гкс_ПравилаУсиленногоКонтроляПоРегистрации</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипВходногоКонтроля</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыУсиленногоКонтроляКачества</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоТС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>МестнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизводственныеСутки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументРегистрации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_РегистрацияНаПЛК</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Показатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ПоказателиАнализовНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторПравила</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/projects/configuration/251027_GKSTCPLK-1788/src/Enums/гкс_СостоянияКачества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>гкс_СостоянияКачества</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеОбщегоРезультата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтборПроб</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПробыНеТребуются</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КачествоПринято</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КачествоНеПринято</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезультатыПробПолучены</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/projects/configuration/251027_GKSTCPLK-1788/src/Documents/гкс_РегистрацияНаПЛК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>гкс_РегистрацияНаПЛК</Name>
			<BasedOn>
				<xr:Item>Document.гкс_ВъездНаКПП</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.гкс_СДИЗНаПЛК</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прицеп</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесБрутто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесНетто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесТары</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Спецификация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_СпецификацияКДоговоруКонтрагента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправительПолучатель</Name>
					<Comment>Для приёмки Грузоотправитель, для отправки Грузополучатель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокументаПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокументаПоставщика</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Внутригрупповой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Собственник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПеревозки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипыТранспортныхСредствДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРегистрации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ТипРегистрации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаВъезда</Name>
					<Comment>Точка маршрута для определения проезда</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RFIDEPC</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.RFIDEPC</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>RFIDTID</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.RFIDTID</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>гкс_ИДРейса</Name>
					<Comment>ERP-2176</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмеренияВеса</Name>
					<Comment>Ед.измерения веса в документе</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЗоныКарантинногоКонтроля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЗоныКарантинногоКонтроляСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесоваяВъезда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_СтруктураПЛК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловиеПроезда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_УсловияПроезда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоПогрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_СтруктураПЛК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаНаОтгрузкуПродукции</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_ЗаявкаНаОтгрузкуПродукции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгрузкаСОдногоБорта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_ВъездНаКПП</v8:Type>
						<v8:Type>cfg:DocumentRef.гкс_СРПВПрибытиеНаПуть</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СДИЗ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_СДИЗЗЕРНО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПунктПогрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/projects/configuration/251027_GKSTCPLK-1788/src/CommonModules/гкс_ВходнойКонтрольКачества/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Регистрирует данные для усиленного входного контроля
// Параметры:
// ДокументРегистрации - ДокументСсылка.гкс_РегистрацияНаПЛК
Процедура ЗарегистрироватьТранспортноеСредствоДляУсиленногоКонтроля(ДокументРегистрации, МестнаяДата) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеПоказателей = Неопределено;
	Если Не ТранспортноеСредствоЗарегистрировано(ДокументРегистрации) Тогда                                        
		ПервоеПоступлениеПостащика = Неопределено;
		ЭтоПервоеТС = ЭтоПервоеТСВСуткахОтПоставщика(ДокументРегистрации, МестнаяДата, ПервоеПоступлениеПостащика);
		Если ТребуетсяУсиленныйКонтроль(ДокументРегистрации, МестнаяДата, ДанныеПоказателей) Тогда
		
			Если ДанныеПоказателей.ПоказателиКонтроля.Количество() > 0 Тогда
				ЗаписатьДанныеПоУсиленномуКонтролюДляРегистрации(ДокументРегистрации, ДанныеПоказателей.ПоказателиКонтроля);
				ЗаписатьПравилаПоУсиленномуКонтролюДляРегистрации(ДокументРегистрации, ДанныеПоказателей.ПравилаКонтроля);
				УстановитьНовыеЗначенияНастройкеУсиленногоКонтроля(
					ДанныеПоказателей.ПравилаКонтроляТС, "Активен", Истина, Ложь);
			КонецЕсли;		
		КонецЕсли;
		ЗаписатьДанныеПоМашинеПоставщика(ДокументРегистрации, МестнаяДата, ЭтоПервоеТС);	
	КонецЕсли;                     
	
КонецПроцедуры  

// Процедура заполняет лаб. анализ и статус прохождения анализа
// Параметры:
// ЛабораторныйАнализ - ДокументСсылка.гкс_ЛабораторныйАнализ 
// ДокументДегистрации - ДокументССылка.гкс_РегистрацияНаПЛК
Процедура ЗаполнитьРегистрПоказателейУсиленногоКонтроляЛабАнализом(ЛабораторныйАнализ, ДокументРегистрации, НазначениеИспользования) Экспорт
	
	НаборЗаписей = РегистрыСведений.гкс_ПоказателиУсиленногоКонтроляПоРегистрации.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ДокументРегистрации.Установить(ДокументРегистрации);
	НаборЗаписей.Отбор.НазначениеИспользования.Установить(НазначениеИспользования);
	НаборЗаписей.Прочитать();
	
	КачественныеПоказатели = ЛабораторныйАнализ.КачественныеПоказатели; 
	Если НаборЗаписей.Количество() = 0
		Или КачественныеПоказатели.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Статус = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЛабораторныйАнализ, "Статус");
	КачествоНеПройдено = Новый Массив;
	Для Каждого Запись Из НаборЗаписей Цикл                   
		Показатель = Запись.Показатель;
		СтрокаПоказатель = КачественныеПоказатели.Найти(Показатель);
		Если Не СтрокаПоказатель = Неопределено Тогда
			Запись.СостояниеКачества = 
				СтатусКачестваПоЛабАнализу(СтрокаПоказатель.СоответствуетНормативу, Статус);
			Если Запись.СостояниеКачества = Перечисления.гкс_СостоянияКачества.КачествоНеПринято Тогда
				КачествоНеПройдено.Добавить(Показатель);
			КонецЕсли;	
			Если НЕ ЗначениеЗаполнено(Запись.ЛабораторныйАнализ) Тогда
				Запись.ЛабораторныйАнализ = ЛабораторныйАнализ;       
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если НаборЗаписей.Модифицированность() Тогда
		НаборЗаписей.Записать();
	КонецЕсли; 
	
	Если КачествоНеПройдено.Количество() > 0 Тогда
		ИзменитьТипНастройкиУсиленногоКонтроля(ДокументРегистрации, КачествоНеПройдено);
	КонецЕсли;	
	
КонецПроцедуры 

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Процедура ИзменитьТипНастройкиУсиленногоКонтроля(ДокументРегистрации, ПоказателиКачества)
	
	НайстройкиКонтроля = 
		НастройкиУсиленногоКонтроляСОтборомПоПоказателям(ДокументРегистрации, ПоказателиКачества);
		
	Если НайстройкиКонтроля.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;	                              
	
	УстановитьНовыеЗначенияНастройкеУсиленногоКонтроля(
		НайстройкиКонтроля, "ТипВходногоКонтроля", 
		Перечисления.гкс_ТипыУсиленногоКонтроляКачества.ПервоеТС,
		Перечисления.гкс_ТипыУсиленногоКонтроляКачества.КаждоеТС);
	
	
КонецПроцедуры                                                                                    
	
Функция НастройкиУсиленногоКонтроляСОтборомПоПоказателям(ДокументРегистрации, ПоказателиКачества)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПравилаУсиленногоКонтроляДляТранспортногоСредства.ИдентификаторПравила КАК ИдентификаторПравила
	               |ИЗ
	               |	РегистрСведений.гкс_ПравилаУсиленногоКонтроляПоРегистрации КАК ПравилаУсиленногоКонтроляДляТранспортногоСредства
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.гкс_НастройкиУсиленногоКонтроляКачества КАК НастройкиУсиленногоКонтроляКачества
	               |		ПО ПравилаУсиленногоКонтроляДляТранспортногоСредства.ИдентификаторПравила = НастройкиУсиленногоКонтроляКачества.ИдентификаторПравила
	               |			И (НастройкиУсиленногоКонтроляКачества.Активен)
	               |			И (НастройкиУсиленногоКонтроляКачества.ТипВходногоКонтроля = &ПервоеТС)
	               |ГДЕ
	               |	ПравилаУсиленногоКонтроляДляТранспортногоСредства.ДокументРегистрации = &ДокументРегистрации
	               |	И ПравилаУсиленногоКонтроляДляТранспортногоСредства.Показатель В(&Показатели)";
	
	Запрос.УстановитьПараметр("Показатели", ПоказателиКачества);
	Запрос.УстановитьПараметр("ДокументРегистрации", ДокументРегистрации);
	Запрос.УстановитьПараметр("ПервоеТС", Перечисления.гкс_ТипыУсиленногоКонтроляКачества.ПервоеТС);
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выгрузить();	
	
КонецФункции	

Функция СтатусКачестваПоЛабАнализу(СоответствуетНормативу, СтатусЛабАнализа)
	
	Если СтатусЛабАнализа = Перечисления.гкс_СтатусыЛабораторногоАнализа.ОтборПробы Тогда
		Результат = Перечисления.гкс_СостоянияКачества.ОтборПроб;
	ИначеЕсли СтатусЛабАнализа = Перечисления.гкс_СтатусыЛабораторногоАнализа.Выполнен Тогда          
		Результат = ?(СоответствуетНормативу,
			Перечисления.гкс_СостоянияКачества.КачествоПринято,
			Перечисления.гкс_СостоянияКачества.КачествоНеПринято);
	Иначе	     
		Результат = Перечисления.гкс_СостоянияКачества.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Результат;
		
КонецФункции	

Функция ЭтоПервоеТСВСуткахОтПоставщика(ДокументРегистрации, МестнаяДата, ПервоеПоступлениеПостащика) 
	Запрос = Новый Запрос;  
	Запрос.УстановитьПараметр("ДокументРегистрации", ДокументРегистрации);
	Запрос.УстановитьПараметр("МестнаяДата", МестнаяДата);
	Запрос.Текст = ТекстЗапросаПервоеТСВСуткахОтПоставщика();
	Результат = Запрос.Выполнить(); 
	ПустойРезультат = Результат.Пустой();
	Если Не ПустойРезультат Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ПервоеПоступлениеПостащика = Выборка.ДокументРегистрации;
	КонецЕсли;
	
	Возврат 
		Результат.Пустой();
КонецФункции 

Функция ТребуетсяУсиленныйКонтроль(ДокументРегистрации, МестнаяДата, ДанныеПоказателей = Неопределено)
	
	ДанныеПоказателей = 
		РегистрыСведений.гкс_НастройкиУсиленногоКонтроляКачества.НайтиПоказателиКачестваДляУсиленногоВходногоКонтроля(
			ДокументРегистрации, МестнаяДата);
	Показатели = ДанныеПоказателей.ПоказателиКонтроля;	
			
	Возврат Показатели.Количество();
	
КонецФункции  

Функция ТранспортноеСредствоЗарегистрировано(ДокументРегистрации)
	
	Запрос = Новый Запрос;                                                                          
	Запрос.УстановитьПараметр("ДокументРегистрации", ДокументРегистрации);
	Запрос.Текст =  
	"ВЫБРАТЬ
    |	ТранспортныеСредстваПоставщикаУсиленногоКонтроля.ДокументРегистрации КАК ДокументРегистрации
    |ИЗ
    |	РегистрСведений.гкс_ТранспортныеСредстваПоставщикаУсиленногоКонтроля КАК ТранспортныеСредстваПоставщикаУсиленногоКонтроля
    |ГДЕ
    |	ТранспортныеСредстваПоставщикаУсиленногоКонтроля.ДокументРегистрации = &ДокументРегистрации";
	
	Результат = Запрос.Выполнить();
	Возврат
		Не Результат.Пустой();
	
КонецФункции

Функция ТекстЗапросаПервоеТСВСуткахОтПоставщика()
	Возврат
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&МестнаяДата, ЧАС, -СмещениеПроизводственныхСуток.Значение), ДЕНЬ) КАК ПроизводственныеСутки,
		|	РегистрацияНаПЛК.Контрагент КАК Контрагент,
		|	РегистрацияНаПЛК.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВТ_Регистрация
		|ИЗ
		|	Документ.гкс_РегистрацияНаПЛК КАК РегистрацияНаПЛК
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Константа.гкс_СмещениеПроизводственныхСуток КАК СмещениеПроизводственныхСуток
		|		ПО (ИСТИНА)
		|ГДЕ
		|	РегистрацияНаПЛК.Ссылка = &ДокументРегистрации
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ТранспортныеСредстваПоставщикаУсиленногоКонтроля.ДокументРегистрации КАК ДокументРегистрации
		|ИЗ
		|	РегистрСведений.гкс_ТранспортныеСредстваПоставщикаУсиленногоКонтроля КАК ТранспортныеСредстваПоставщикаУсиленногоКонтроля
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Регистрация КАК ВТ_Регистрация
		|		ПО ТранспортныеСредстваПоставщикаУсиленногоКонтроля.ПроизводственныеСутки = ВТ_Регистрация.ПроизводственныеСутки
		|			И ТранспортныеСредстваПоставщикаУсиленногоКонтроля.Контрагент = ВТ_Регистрация.Контрагент
		|			И ТранспортныеСредстваПоставщикаУсиленногоКонтроля.Номенклатура = ВТ_Регистрация.Номенклатура
		|ГДЕ
		|	ТранспортныеСредстваПоставщикаУсиленногоКонтроля.ЭтоПервоеТС";
		
КонецФункции	

Функция ИнициироватьТаблицуРегистрацииПоказателей()
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("ДокументРегистрации");
	Таблица.Колонки.Добавить("Показатель");
	Таблица.Колонки.Добавить("ЗначениеПоказателяМин");
	Таблица.Колонки.Добавить("ЗначениеПоказателяМакс");  
	Таблица.Колонки.Добавить("Базис");  
	
	Возврат Таблица;
	
КонецФункции

Процедура ЗаписатьДанныеПоУсиленномуКонтролюДляРегистрации(ДокументРегистрации, ТаблицаПоказателей)
	
	НаборЗаписей = РегистрыСведений.гкс_ПоказателиУсиленногоКонтроляПоРегистрации.СоздатьНаборЗаписей();	
	НаборЗаписей.Отбор.ДокументРегистрации.Установить(ДокументРегистрации);  
	НаборЗаписей.Загрузить(ТаблицаПоказателей);
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ЗаписатьДанныеПоМашинеПоставщика(ДокументРегистрации, МестнаяДата, ЭтоПервоеТС)
	
	Реквизиты = "ТранспортноеСредство, Контрагент, Номенклатура";
	
	НаборЗаписей = РегистрыСведений.гкс_ТранспортныеСредстваПоставщикаУсиленногоКонтроля.СоздатьНаборЗаписей();	
	НаборЗаписей.Отбор.ДокументРегистрации.Установить(ДокументРегистрации);   
	Запись = НаборЗаписей.Добавить();
	ЗаполнитьЗначенияСвойств(Запись, ДокументРегистрации, Реквизиты);
	Запись.МестнаяДата = МестнаяДата;
	Запись.ПроизводственныеСутки = 
		гкс_ПриемкаТранспорта.ПроизводственныеСуткиПоДата(МестнаяДата);
	Запись.ЭтоПервоеТС = ЭтоПервоеТС;	
	Запись.ДокументРегистрации = ДокументРегистрации;
	НаборЗаписей.Записать();
	
КонецПроцедуры   

Процедура ЗаписатьПравилаПоУсиленномуКонтролюДляРегистрации(ДокументРегистрации, ПравилаКонтроля)
	
	НаборЗаписей = РегистрыСведений.гкс_ПравилаУсиленногоКонтроляПоРегистрации.СоздатьНаборЗаписей();	
	НаборЗаписей.Отбор.ДокументРегистрации.Установить(ДокументРегистрации);                                         
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() <> 0 Тогда
		НаборЗаписей.Очистить();
	КонецЕсли;
	НаборЗаписей.Загрузить(ПравилаКонтроля);
	НаборЗаписей.Записать();
	
КонецПроцедуры	

Процедура УстановитьНовыеЗначенияНастройкеУсиленногоКонтроля(ПравилаКонтроляТС, ИмяРеквизита, СтароеЗначение, НовоеЗначение)
	
	Для каждого ПравилоТС из ПравилаКонтроляТС цикл
		НаборЗаписей = РегистрыСведений.гкс_НастройкиУсиленногоКонтроляКачества.СоздатьНаборЗаписей();	
		НаборЗаписей.Отбор.ИдентификаторПравила.Установить(ПравилоТС.ИдентификаторПравила);                                         
		НаборЗаписей.Прочитать();
		Для каждого Запись из НаборЗаписей цикл
			Если Запись[ИмяРеквизита] = СтароеЗначение Тогда
				Запись[ИмяРеквизита] = НовоеЗначение;
			КонецЕсли;	
		КонецЦикла;   
		Если НаборЗаписей.Модифицированность() Тогда
			НаборЗаписей.Записать();
		КонецЕсли;	
	КонецЦикла;	
	
КонецПроцедуры	

#КонецОбласти
